### Imports

In [1]:
import requests
import pandas as pd
from sqlalchemy import create_engine
import psycopg2
import warnings

### Initializations

In [2]:
# warnings
warnings.filterwarnings('ignore')

# postgresql db
engine = create_engine(f'postgresql://postgres:password@localhost/FlightDB')

In [3]:
# read in flight data
unionAllDF = pd.read_csv('Resources/unionAllDF.csv')
unionAllDF.columns=['flightdate','airline','ch_code','flightnumber','departuretime','locationfrom','timetaken','stop',
                    'arrivaltime','locationto','price','seatclass']

# assign data types to columns
unionAllDF['flightdate']= pd.to_datetime(unionAllDF['flightdate'], infer_datetime_format=True)
unionAllDF['flightnumber']= unionAllDF['flightnumber'].astype(str)
unionAllDF['departuretime']= pd.to_datetime(unionAllDF['departuretime'], infer_datetime_format=True)
unionAllDF['arrivaltime']= pd.to_datetime(unionAllDF['arrivaltime'], infer_datetime_format=True)
unionAllDF.dtypes

flightdate       datetime64[ns]
airline                  object
ch_code                  object
flightnumber             object
departuretime    datetime64[ns]
locationfrom             object
timetaken                object
stop                     object
arrivaltime      datetime64[ns]
locationto               object
price                   float64
seatclass                object
dtype: object

### Extract Transfer Load

#### Table: airline

In [4]:
# create airline DF
airlineDF = unionAllDF[['airline', 'ch_code']].copy()
airlineDF.drop_duplicates(inplace=True)
airlineDF.sort_values(by=['airline'], inplace=True)
airlineDF.insert(0, 'airlineid', range(1, 1 + len(airlineDF.index)))
airlineDF.columns=['airlineid','airline','designator']

# write DF to SQL
airlineDF.to_sql(name='airline', con=engine, if_exists='replace', index=False)

# build dict for lookup
airline_dict = dict(zip(airlineDF.airline, airlineDF.airlineid))
airline_dict

{'Air India': 1,
 'AirAsia': 2,
 'GO FIRST': 3,
 'Indigo': 4,
 'SpiceJet': 5,
 'StarAir': 6,
 'Trujet': 7,
 'Vistara': 8}

In [5]:
airlineDF.head(2)

    airlineid    airline designator
16          1  Air India         AI
2           2    AirAsia         I5

#### Table: location

In [6]:
unionAllDF.head(2)

,flightdate,airline,ch_code,flightnumber,departuretime,locationfrom,timetaken,stop,arrivaltime,locationto,price,seatclass
0,2022-11-02,SpiceJet,SG,8709,2022-11-17 18:55:00,Delhi,02h 10m,non-stop,2022-11-17 21:05:00,Mumbai,73.34096,economy
1,2022-11-02,SpiceJet,SG,8157,2022-11-17 06:20:00,Delhi,02h 20m,non-stop,2022-11-17 08:40:00,Mumbai,73.34096,economy

In [7]:
# create location DF
locationDF = unionAllDF[['locationfrom']].copy()
locationDF.columns=['locationname']

locationtoDF = unionAllDF[['locationto']].copy()
locationtoDF.columns=['locationname']

locationDF = pd.concat([locationDF, locationtoDF])
locationDF.drop_duplicates(inplace=True)
locationDF.sort_values(by=['locationname'], inplace=True)
locationDF.insert(0, 'locationid', range(1, 1 + len(locationDF.index)))

# write DF to SQL
locationDF.to_sql(name='location', con=engine, if_exists='replace', index=False)

# build dict for lookup
location_dict = dict(zip(locationDF.locationname, locationDF.locationid))
location_dict

{'Bangalore': 1,
 'Chennai': 2,
 'Delhi': 3,
 'Hyderabad': 4,
 'Kolkata': 5,
 'Mumbai': 6}

In [8]:
locationDF.head(2)

        locationid locationname
84072            1    Bangalore
180601           2      Chennai

#### Table: seatclass

In [9]:
# create seatclass DF
seatclassDF = unionAllDF[['seatclass']].copy()
seatclassDF.drop_duplicates(inplace=True)
seatclassDF.sort_values(by=['seatclass'], inplace=True)
seatclassDF.insert(0, 'seatclassid', range(1, 1 + len(seatclassDF.index)))

# write DF to SQL
seatclassDF.to_sql(name='seatclass', con=engine, if_exists='replace', index=False)

# build dict for lookup
seatclass_dict = dict(zip(seatclassDF.seatclass, seatclassDF.seatclassid))
seatclass_dict

{'business': 1, 'economy': 2}

In [10]:
seatclassDF.head(2)

        seatclassid seatclass
206772            1  business
0                 2   economy

#### Table: stop

In [11]:
# create airline DF
stopDF = unionAllDF[['stop']].copy()
stopDF.drop_duplicates(inplace=True)
stopDF.sort_values(by=['stop'], inplace=True)
stopDF.insert(0, 'stopid', range(1, 1 + len(stopDF.index)))

# write DF to SQL
stopDF.to_sql(name='stop', con=engine, if_exists='replace', index=False)

# build dict for lookup
stop_dict = dict(zip(stopDF.stop, stopDF.stopid))
stop_dict

{'1-stop': 1, '2-stops': 2, 'non-stop': 3}

In [12]:
stopDF.head(3)

     stopid      stop
18        1    1-stop
175       2   2-stops
0         3  non-stop

#### Tables: flight and flightclass

In [13]:
unionAllDF.head(2)

,flightdate,airline,ch_code,flightnumber,departuretime,locationfrom,timetaken,stop,arrivaltime,locationto,price,seatclass
0,2022-11-02,SpiceJet,SG,8709,2022-11-17 18:55:00,Delhi,02h 10m,non-stop,2022-11-17 21:05:00,Mumbai,73.34096,economy
1,2022-11-02,SpiceJet,SG,8157,2022-11-17 06:20:00,Delhi,02h 20m,non-stop,2022-11-17 08:40:00,Mumbai,73.34096,economy

In [14]:
flight_tup = ()
flight_dict = {}

flightclass_tup = ()
flightclass_dict = {}

# check flight data
for index, row in unionAllDF.iterrows():
    
    flight_tup = (row.airline, row.flightdate, row.flightnumber, row.stop, row.departuretime, row.locationfrom, 
                  row.locationto, row.timetaken, row.arrivaltime)
    
    lookupflightkey = flight_dict.get(flight_tup)
    
    if lookupflightkey is None:
        flightid = index
        flight_dict[flight_tup] = flightid
    else:
        flightid = lookupflightkey
        
        flightclass_tup = (flightid, seatclass_dict.get(row.seatclass), row.price)        
        lookupflightkey = flightclass_dict.get(flightclass_tup)
        
        if lookupflightkey is None:
            flightclassid = index
            flightclass_dict[flightclass_tup] = flightclassid

In [26]:
flightDF = pd.DataFrame(columns=['flightid','airlineid','flightdate','flightnumber','stopid','departuretime',
                                 'locationfromid','locationtoid','timetaken','arrivaltime']) 

for k, v in flight_dict.items():
    a, b, c, d, e, f, g, h, i = k
    flightDF.loc[len(flightDF.index)] = [v, airline_dict.get(a), b, c, stop_dict.get(d), e, 
                                         location_dict.get(f), location_dict.get(g), h, i]
    
flightclassDF.rename(columns=flightclassDF.iloc[0]).drop(flightclassDF.index[0])
# write DF to SQL
flightDF.to_sql(name='flight', con=engine, if_exists='replace', index=False)
flightDF.head(2)

,flightid,airlineid,flightdate,flightnumber,stopid,departuretime,locationfromid,locationtoid,timetaken,arrivaltime
0,0,5,2022-11-02,8709,3,2022-11-17 18:55:00,3,6,02h 10m,2022-11-17 21:05:00

In [28]:
flightclassDF = pd.DataFrame(columns=['flightclassid','flightid','seatclassid','price'])

for k, v in flightclass_dict.items():
    flightid, seatclassid, price = k
    flightclassDF.loc[len(flightclassDF.index)] = [v, flightid, seatclassid, price]
    
# write DF to SQL
flightclassDF.to_sql(name='flight_class', con=engine, if_exists='replace', index=False)
flightclassDF.head(2)

   flightclassid  flightid  seatclassid      price
0        10073.0   10054.0          2.0  232.95888
1        10074.0   10055.0          2.0  232.95888